{
  "result": [
    {
      "id": 84958,
      "releaseDate": "2021-06-09",
      "name": "Loki",
      "overview": "After stealing the Tesseract during the events of “Avengers: Endgame,” an alternate version of Loki is brought to the mysterious Time Variance Authority, a bureaucratic organization that exists outside of time and space and monitors the timeline. They give Loki a choice: face being erased from existence due to being a “time variant”or help fix the timeline and stop a greater threat.",
      "posterPath": "/kEl2t3OhXc3Zb9FBh1AuYzRTgZp.jpg",
      "voteAverage": 8.1
    },
    {
      "id": 60735,
      "releaseDate": "2014-10-07",
      "name": " The Flash",
      "overview": "After a particle accelerator causes a freak storm, CSI Investigator Barry Allen is struck by lightning and falls into a coma. Months later he awakens with the power of super speed, granting him the ability to move through Central City like an unseen guardian angel. Though initially excited by his newfound powers, Barry is shocked to discover he is not the only \"meta-human\" who was created in the wake of the accelerator explosion -- and not everyone is using their new powers for good. Barry partners with S.T.A.R. Labs and dedicates his life to protect the innocent. For now, only a few close friends and associates know that Barry is literally the fastest man alive, but it won't be long before the world learns what Barry Allen has become...The Flash.",
      "posterPath": "/lJA2RCMfsWoskqlQhXPSLFQGXEJ.jpg",
      "voteAverage": 7.7
    },
    {
      "id": 95057,
      "releaseDate": "2021-02-23",
      "name": " Superman & Lois ",
      "overview": "After years of facing megalomaniacal supervillains, monsters wreaking havoc on Metropolis, and alien invaders intent on wiping out the human race, The Man of Steel aka Clark Kent and Lois Lane come face to face with one of their greatest challenges ever: dealing with all the stress, pressures and complexities that come with being working parents in today's society.",
      "posterPath": "/vlv1gn98GqMnKHLSh0dNciqGfBl.jpg",
      "voteAverage": 8.3
    },
    {
      "id": 60625,
      "releaseDate": "2013-12-02",
      "name": " Rick and Morty ",
      "overview": "Rick is a mentally-unbalanced but scientifically-gifted old man who has recently reconnected with his family. He spends most of his time involving his young grandson Morty in dangerous, outlandish adventures throughout space and alternate universes. Compounded with Morty's already unstable family life, these events cause Morty much distress at home and school.",
      "posterPath": "/8kOWDBK6XlPUzckuHDo3wwVRFwt.jpg",
      "voteAverage": 8.7
    },
    {
      "id": 79460,
      "releaseDate": "2018-10-25",
      "name": " Legacies ",
      "overview": "In a place where young witches, vampires, and werewolves are nurtured to be their best selves in spite of their worst impulses, Klaus Mikaelson’s daughter, 17-year-old Hope Mikaelson, Alaric Saltzman’s twins, Lizzie and Josie Saltzman, among others, come of age into heroes and villains at The Salvatore School for the Young and Gifted.",
      "posterPath": "/qTZIgXrBKURBK1KrsT7fe3qwtl9.jpg",
      "voteAverage": 8.6
    },
    {
      "id": 105971,
      "releaseDate": "2021-05-04",
      "name": " The Bad Batch ",
      "overview": "The 'Bad Batch' of elite and experimental clones make their way through an ever-changing galaxy in the immediate aftermath of the Clone Wars.",
      "posterPath": "/WjQmEWFrOf98nT5aEfUfVYz9N2.jpg",
      "voteAverage": 8.7
    },
    {
      "id": 58142,
      "releaseDate": "2021-06-04",
      "name": "Paraíso",
      "overview": "Paraiso is a 2012 Philippine daytime television drama that aired on ABS-CBN from November 5, 2012 to April 5, 2013, replacing the PHR's high-rating series entitled Pintada which was starred Denise Laurel and Martin del Rosario.\n\nParaiso is the 17th installment of the Precious Hearts Romances series, and is topbilled by Jessy Mendiola and Matteo Guidicelli.",
      "posterPath": "/6KkM6gLFloyybv6qFZs6t5taWws.jpg",
      "voteAverage": 0.0
    },
    {
      "id": 119243,
      "releaseDate": "2021-06-17",
      "name": "iCarly",
      "overview": "Ten years after signing off of one of TV's most iconic shows, Carly, Spencer, and Freddie are back, navigating the next chapter of their lives, facing the uncertainties of life in their twenties.",
      "posterPath": "/s5k4GqTUGXeUdScNrjpYfiQLKHI.jpg",
      "voteAverage": 8.5
    },
    {
      "id": 65820,
      "releaseDate": "2016-09-23",
      "name": "Van Helsing",
      "overview": "Vanessa Helsing, the daughter of famous vampire hunter and Dracula nemesis Abraham Van Helsing is resurrected five years in the future to find out that vampires have taken over the world and that she possesses unique power over them. She is humanity’s last hope to lead an offensive to take back what has been lost.",
      "posterPath": "/r8ODGmfNbZQlNhiJl2xQENE2jsk.jpg",
      "voteAverage": 7.0
    },
    {
      "id": 105009,
      "releaseDate": "2021-04-11",
      "name": "Tokyo Revengers",
      "overview": "Takemichi Hanagaki is a freelancer that’s reached the absolute pits of despair in his life. He finds out that the only girlfriend he ever had, in middle school, Hinata Tachibana, had been killed by the ruthless Tokyo Manji Gang. The day after hearing about her death, he’s standing on the station platform and ends up being pushed over onto the tracks by a herd of people. He closes his eyes thinking he’s about to die, but when he opens his eyes back up, he somehow had gone back in time 12 years. Now that he’s back living the best days of his life, Takemichi decides to get revenge on his life.",
      "posterPath": "/qSEKyf0fWhrCEQ3LTwLqe41eSvR.jpg",
      "voteAverage": 8.0
    },
    {
      "id": 46952,
      "releaseDate": "2013-09-23",
      "name": "The Blacklist",
      "overview": "Raymond \"Red\" Reddington, one of the FBI's most wanted fugitives, surrenders in person at FBI Headquarters in Washington, D.C. He claims that he and the FBI have the same interests: bringing down dangerous criminals and terrorists. In the last two decades, he's made a list of criminals and terrorists that matter the most but the FBI cannot find because it does not know they exist. Reddington calls this \"The Blacklist\". Reddington will co-operate, but insists that he will speak only to Elizabeth Keen, a rookie FBI profiler.",
      "posterPath": "/htJzeRcYI2ewMm4PTrg98UMXShe.jpg",
      "voteAverage": 7.4
    },
    {
      "id": 104877,
      "releaseDate": "2020-07-08",
      "name": "You Knock on My Door",
      "overview": "Connecting all her hopes in her life to her education, Eda comes face to face with Serkan Bolat, who unknowingly cuts her scholarship abroad and caused her to remain a high school graduate. Serkan Bolat offers to give Eda her scholarship back if she pretends to be engaged to him for two months. Eda first rejects the offer due to her hatred for him, but when circumstances change, she has no choice but to accept the offer. While pretending to be engaged, Serkan and Eda begin to have a passionate, challenging relationship that will make you forget all they know right, because love is hard. And that's why it's amazing!!",
      "posterPath": "/nzBenFJ2D2MCWTwTt2uc4BGWLtA.jpg",
      "voteAverage": 8.1
    },
    {
      "id": 85801,
      "releaseDate": "2019-11-12",
      "name": "High School Musical: The Musical: The Series",
      "overview": "A group of East High students countdown to the opening night of their school’s first-ever production of “High School Musical.” Showmances blossom; friendships are tested while new ones are made; rivalries flare and lives are changed forever as these young people discover the transformative power that only a high school drama club can provide.",
      "posterPath": "/9S3BS5oS9a8sNiTWuZi9aveE4bR.jpg",
      "voteAverage": 8.1
    },
    {
      "id": 89247,
      "releaseDate": "2019-10-06",
      "name": "Batwoman",
      "overview": "Kate Kane, armed with a passion for social justice and a flair for speaking her mind, soars onto the streets of Gotham as Batwoman, an out lesbian and highly trained street fighter primed to snuff out the failing city's criminal resurgence. But don't call her a hero yet. In a city desperate for a savior, Kate must overcome her own demons before embracing the call to be Gotham's symbol of hope",
      "posterPath": "/xjyEpcuDbB1jy0ehNQMBiO8KOdr.jpg",
      "voteAverage": 7.3
    },
    {
      "id": 62643,
      "releaseDate": "2016-01-21",
      "name": "DC's Legends of Tomorrow",
      "overview": "When heroes alone are not enough ... the world needs legends. Having seen the future, one he will desperately try to prevent from happening, time-traveling rogue Rip Hunter is tasked with assembling a disparate group of both heroes and villains to confront an unstoppable threat — one in which not only is the planet at stake, but all of time itself. Can this ragtag team defeat an immortal threat unlike anything they have ever known?",
      "posterPath": "/uzQpQGISbtxc047IOssFo5AiDwU.jpg",
      "voteAverage": 7.2
    },
    {
      "id": 79611,
      "releaseDate": "2018-10-14",
      "name": "Charmed",
      "overview": "Set in the fictional college town of Hilltowne, Charmed follows the lives of three sisters, Macy, Mel and Maggie Vera who, after the tragic death of their mother, discover they are three of the most powerful witches of all time.",
      "posterPath": "/jyArBuSbEnSoQinAZBU6pZmmL6M.jpg",
      "voteAverage": 7.3
    },
    {
      "id": 66084,
      "releaseDate": "2014-09-27",
      "name": "Acapulco Shore",
      "overview": "A reality-based look at the vapid lives of several Mexican 20-somethings and their respective friends and/or hook-ups during their stay in Acapulco for a Summer vacation.",
      "posterPath": "/7sfy3nq1CjeoOgwg3N9hO8vLZSH.jpg",
      "voteAverage": 7.9
    },
    {
      "id": 32415,
      "releaseDate": "2010-11-08",
      "name": "Conan",
      "overview": "A late night television talk show hosted by  Conan O'Brien.",
      "posterPath": "/oQxrvUhP3ycwnlxIrIMQ9Z3kleq.jpg",
      "voteAverage": 7.2
    },
    {
      "id": 1433,
      "releaseDate": "2005-02-06",
      "name": "American Dad!",
      "overview": "The series focuses on an eccentric motley crew that is the Smith family and their three housemates: Father, husband, and breadwinner Stan Smith; his better half housewife, Francine Smith; their college-aged daughter, Hayley Smith; and their high-school-aged son, Steve Smith. Outside of the Smith family, there are three additional main characters, including Hayley's boyfriend turned husband, Jeff Fischer; the family's man-in -a-goldfish-body pet, Klaus; and most notably the family's zany alien, Roger, who is \"full of masquerades, brazenness, and shocking antics.\"",
      "posterPath": "/aC1q422YhQR7k82GB8gW4KoD91p.jpg",
      "voteAverage": 6.8
    },
    {
      "id": 116386,
      "releaseDate": "2021-05-10",
      "name": "Doom at Your Service",
      "overview": "Dong-kyung has been working hard ever since her parents passed away. Her life seems to get stable after working as an web novel editor for 6 years, but one day she gets diagnosed with a brain cancer. She blames her unlucky life and wishes to curse everything to disappear, which unintentionally calls Myul Mang, a messenger between humans and gods, to appear. He says that he can grant her wishes. As her last hope, she makes a contract with Myul Mang for hundred days to live as how she wants, risking her everything.",
      "posterPath": "/o1aus1uSJH0S4FDUlBRCSfKEKuW.jpg",
      "voteAverage": 9.2
    }
  ]
}